zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_FCCU.h
#define FCCU_CFG_FOM_MASK                        (0x1C0U)
#define FCCU_CFG_FOM_SHIFT                       (6U)
/*! FOM - Fault-Output (EOUT) Mode
 *  0b000..Reserved
 *  0b001..Reserved
 *  0b010..Bi-Stable
 *  0b011..Reserved
 *  0b100..Reserved
 *  0b101..Test 0 (controlled by the EINOUT register; EOUT1 is an output; EOUT0 is an input)
 *  0b110..Test 1 (controlled by the EINOUT register; EOUT1 and EOUT0 are both outputs)
 *  0b111..Test 2 (controlled by the EINOUT register; EOUT1 is an input; EOUT0 is an output)
 */
#define FCCU_CFG_FOM(x)                          (((uint32_t)(((uint32_t)(x)) << FCCU_CFG_FOM_SHIFT)) & FCCU_CFG_FOM_MASK)

#define FCCU_CFG_PS_MASK                         (0x200U)
#define FCCU_CFG_PS_SHIFT                        (9U)
/*! PS - Fault-Output (EOUT) Polarity Selection
 *  0b0..For the faulty indication, EOUT1 is high, and EOUT0 is low.
 *  0b1..For the faulty indication, EOUT1 is low, and EOUT0 is high.
 */
#define FCCU_CFG_PS(x)                           (((uint32_t)(((uint32_t)(x)) << FCCU_CFG_PS_SHIFT)) & FCCU_CFG_PS_MASK)

#define FCCU_CFG_CM_MASK                         (0x800U)
#define FCCU_CFG_CM_SHIFT                        (11U)
/*! CM - Fault-Output (EOUT) Configuration-Indication Mode
 *  0b0..Different
 *  0b1..Same
 */
#define FCCU_CFG_CM(x)                           (((uint32_t)(((uint32_t)(x)) << FCCU_CFG_CM_SHIFT)) & FCCU_CFG_CM_MASK)

#define FCCU_CFG_FCCU_SET_CLEAR_MASK             (0xC00000U)
#define FCCU_CFG_FCCU_SET_CLEAR_SHIFT            (22U)
/*! FCCU_SET_CLEAR - Fault-Output (EOUT) Control
 *  0b00..Controlled by the FSM
 *  0b01..Always low
 *  0b10..Controlled by the FSM
 *  0b11..High until a fault occurs on a channel, regardless of whether that fault is disabled; thereafter,
 *        controlled by the FSM. Note: FCCU ignores an attempt to write this value if the fault-output (EOUT) timer is
 *        already running.
 */
#define FCCU_CFG_FCCU_SET_CLEAR(x)               (((uint32_t)(((uint32_t)(x)) << FCCU_CFG_FCCU_SET_CLEAR_SHIFT)) & FCCU_CFG_FCCU_SET_CLEAR_MASK)

#define FCCU_CFG_FCCU_SET_AFTER_RESET_MASK       (0x1000000U)
#define FCCU_CFG_FCCU_SET_AFTER_RESET_SHIFT      (24U)
/*! FCCU_SET_AFTER_RESET - Fault-Output (EOUT) Activate
 *  0b0..Inactive (the EOUT signals are in a high-impedance state)
 *  0b1..Active (the EOUT signals indicate FCCU's condition)
 */
#define FCCU_CFG_FCCU_SET_AFTER_RESET(x)         (((uint32_t)(((uint32_t)(x)) << FCCU_CFG_FCCU_SET_AFTER_RESET_SHIFT)) & FCCU_CFG_FCCU_SET_AFTER_RESET_MASK)
/*! @} */

/*! @name NCF_CFG - Non-critical Fault Configuration */
/*! @{ */

#define FCCU_NCF_CFG_NCFC0_MASK                  (0x1U)
#define FCCU_NCF_CFG_NCFC0_SHIFT                 (0U)
/*! NCFC0 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC0(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC0_SHIFT)) & FCCU_NCF_CFG_NCFC0_MASK)

#define FCCU_NCF_CFG_NCFC1_MASK                  (0x2U)
#define FCCU_NCF_CFG_NCFC1_SHIFT                 (1U)
/*! NCFC1 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC1(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC1_SHIFT)) & FCCU_NCF_CFG_NCFC1_MASK)

#define FCCU_NCF_CFG_NCFC2_MASK                  (0x4U)
#define FCCU_NCF_CFG_NCFC2_SHIFT                 (2U)
/*! NCFC2 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC2(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC2_SHIFT)) & FCCU_NCF_CFG_NCFC2_MASK)

#define FCCU_NCF_CFG_NCFC3_MASK                  (0x8U)
#define FCCU_NCF_CFG_NCFC3_SHIFT                 (3U)
/*! NCFC3 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC3(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC3_SHIFT)) & FCCU_NCF_CFG_NCFC3_MASK)

#define FCCU_NCF_CFG_NCFC4_MASK                  (0x10U)
#define FCCU_NCF_CFG_NCFC4_SHIFT                 (4U)
/*! NCFC4 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC4(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC4_SHIFT)) & FCCU_NCF_CFG_NCFC4_MASK)

#define FCCU_NCF_CFG_NCFC5_MASK                  (0x20U)
#define FCCU_NCF_CFG_NCFC5_SHIFT                 (5U)
/*! NCFC5 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC5(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC5_SHIFT)) & FCCU_NCF_CFG_NCFC5_MASK)

#define FCCU_NCF_CFG_NCFC6_MASK                  (0x40U)
#define FCCU_NCF_CFG_NCFC6_SHIFT                 (6U)
/*! NCFC6 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC6(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC6_SHIFT)) & FCCU_NCF_CFG_NCFC6_MASK)

#define FCCU_NCF_CFG_NCFC7_MASK                  (0x80U)
#define FCCU_NCF_CFG_NCFC7_SHIFT                 (7U)
/*! NCFC7 - Non-critical Fault Configuration n
 *  0b0..Hardware-recoverable
 *  0b1..Software-recoverable
 */
#define FCCU_NCF_CFG_NCFC7(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NCF_CFG_NCFC7_SHIFT)) & FCCU_NCF_CFG_NCFC7_MASK)
/*! @} */

/*! @name NCFS_CFG - Non-critical Fault-State Configuration */
/*! @{ */

#define FCCU_NCFS_CFG_NCFSC0_MASK                (0x3U)
#define FCCU_NCFS_CFG_NCFSC0_SHIFT               (0U)
/*! NCFSC0 - Non-critical Fault-State Configuration n
 *  0b00..Disabled
 *  0b01..Enabled (rst_sfunc_b) (short)
 *  0b10..Reserved
 *  0b11..Disabled
 */
#define FCCU_NCFS_CFG_NCFSC0(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC0_SHIFT)) & FCCU_NCFS_CFG_NCFSC0_MASK)

#define FCCU_NCFS_CFG_NCFSC1_MASK                (0xCU)
#define FCCU_NCFS_CFG_NCFSC1_SHIFT               (2U)
/*! NCFSC1 - Non-critical Fault-State Configuration n
 *  0b00..Disabled
 *  0b01..Enabled (rst_sfunc_b) (short)
 *  0b10..Reserved
 *  0b11..Disabled
 */
#define FCCU_NCFS_CFG_NCFSC1(x)                  (((uint32_t)(((uint32_t)(x)) << FCCU_NCFS_CFG_NCFSC1_SHIFT)) & FCCU_NCFS_CFG_NCFSC1_MASK)

