zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_FCCU.h
#define FCCU_IRQ_ALARM_EN_IRQEN1_MASK            (0x2U)
#define FCCU_IRQ_ALARM_EN_IRQEN1_SHIFT           (1U)
/*! IRQEN1 - Non-critical Alarm-State Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_IRQ_ALARM_EN_IRQEN1(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN1_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN1_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN2_MASK            (0x4U)
#define FCCU_IRQ_ALARM_EN_IRQEN2_SHIFT           (2U)
/*! IRQEN2 - Non-critical Alarm-State Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_IRQ_ALARM_EN_IRQEN2(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN2_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN2_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN3_MASK            (0x8U)
#define FCCU_IRQ_ALARM_EN_IRQEN3_SHIFT           (3U)
/*! IRQEN3 - Non-critical Alarm-State Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_IRQ_ALARM_EN_IRQEN3(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN3_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN3_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN4_MASK            (0x10U)
#define FCCU_IRQ_ALARM_EN_IRQEN4_SHIFT           (4U)
/*! IRQEN4 - Non-critical Alarm-State Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_IRQ_ALARM_EN_IRQEN4(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN4_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN4_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN5_MASK            (0x20U)
#define FCCU_IRQ_ALARM_EN_IRQEN5_SHIFT           (5U)
/*! IRQEN5 - Non-critical Alarm-State Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_IRQ_ALARM_EN_IRQEN5(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN5_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN5_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN6_MASK            (0x40U)
#define FCCU_IRQ_ALARM_EN_IRQEN6_SHIFT           (6U)
/*! IRQEN6 - Non-critical Alarm-State Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_IRQ_ALARM_EN_IRQEN6(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN6_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN6_MASK)

#define FCCU_IRQ_ALARM_EN_IRQEN7_MASK            (0x80U)
#define FCCU_IRQ_ALARM_EN_IRQEN7_SHIFT           (7U)
/*! IRQEN7 - Non-critical Alarm-State Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_IRQ_ALARM_EN_IRQEN7(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_IRQ_ALARM_EN_IRQEN7_SHIFT)) & FCCU_IRQ_ALARM_EN_IRQEN7_MASK)
/*! @} */

/*! @name NMI_EN - Non-critical Fault-State Non-maskable-Interrupt-Request Enable */
/*! @{ */

#define FCCU_NMI_EN_NMIEN0_MASK                  (0x1U)
#define FCCU_NMI_EN_NMIEN0_SHIFT                 (0U)
/*! NMIEN0 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN0(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN0_SHIFT)) & FCCU_NMI_EN_NMIEN0_MASK)

#define FCCU_NMI_EN_NMIEN1_MASK                  (0x2U)
#define FCCU_NMI_EN_NMIEN1_SHIFT                 (1U)
/*! NMIEN1 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN1(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN1_SHIFT)) & FCCU_NMI_EN_NMIEN1_MASK)

#define FCCU_NMI_EN_NMIEN2_MASK                  (0x4U)
#define FCCU_NMI_EN_NMIEN2_SHIFT                 (2U)
/*! NMIEN2 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN2(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN2_SHIFT)) & FCCU_NMI_EN_NMIEN2_MASK)

#define FCCU_NMI_EN_NMIEN3_MASK                  (0x8U)
#define FCCU_NMI_EN_NMIEN3_SHIFT                 (3U)
/*! NMIEN3 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN3(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN3_SHIFT)) & FCCU_NMI_EN_NMIEN3_MASK)

#define FCCU_NMI_EN_NMIEN4_MASK                  (0x10U)
#define FCCU_NMI_EN_NMIEN4_SHIFT                 (4U)
/*! NMIEN4 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN4(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN4_SHIFT)) & FCCU_NMI_EN_NMIEN4_MASK)

#define FCCU_NMI_EN_NMIEN5_MASK                  (0x20U)
#define FCCU_NMI_EN_NMIEN5_SHIFT                 (5U)
/*! NMIEN5 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN5(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN5_SHIFT)) & FCCU_NMI_EN_NMIEN5_MASK)

#define FCCU_NMI_EN_NMIEN6_MASK                  (0x40U)
#define FCCU_NMI_EN_NMIEN6_SHIFT                 (6U)
/*! NMIEN6 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN6(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN6_SHIFT)) & FCCU_NMI_EN_NMIEN6_MASK)

#define FCCU_NMI_EN_NMIEN7_MASK                  (0x80U)
#define FCCU_NMI_EN_NMIEN7_SHIFT                 (7U)
/*! NMIEN7 - Non-critical Fault-State Non-maskable-Interrupt-Request Enable n
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define FCCU_NMI_EN_NMIEN7(x)                    (((uint32_t)(((uint32_t)(x)) << FCCU_NMI_EN_NMIEN7_SHIFT)) & FCCU_NMI_EN_NMIEN7_MASK)
/*! @} */

/*! @name EOUT_SIG_EN - Non-critical Fault-State EOUT Signaling Enable */
/*! @{ */

#define FCCU_EOUT_SIG_EN_EOUTEN0_MASK            (0x1U)
#define FCCU_EOUT_SIG_EN_EOUTEN0_SHIFT           (0U)
/*! EOUTEN0 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN0(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN0_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN0_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN1_MASK            (0x2U)
#define FCCU_EOUT_SIG_EN_EOUTEN1_SHIFT           (1U)
/*! EOUTEN1 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN1(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN1_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN1_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN2_MASK            (0x4U)
#define FCCU_EOUT_SIG_EN_EOUTEN2_SHIFT           (2U)
/*! EOUTEN2 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN2(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN2_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN2_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN3_MASK            (0x8U)
#define FCCU_EOUT_SIG_EN_EOUTEN3_SHIFT           (3U)
/*! EOUTEN3 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN3(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN3_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN3_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN4_MASK            (0x10U)
#define FCCU_EOUT_SIG_EN_EOUTEN4_SHIFT           (4U)
/*! EOUTEN4 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN4(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN4_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN4_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN5_MASK            (0x20U)
#define FCCU_EOUT_SIG_EN_EOUTEN5_SHIFT           (5U)
/*! EOUTEN5 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN5(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN5_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN5_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN6_MASK            (0x40U)
#define FCCU_EOUT_SIG_EN_EOUTEN6_SHIFT           (6U)
/*! EOUTEN6 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN6(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN6_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN6_MASK)

#define FCCU_EOUT_SIG_EN_EOUTEN7_MASK            (0x80U)
#define FCCU_EOUT_SIG_EN_EOUTEN7_SHIFT           (7U)
/*! EOUTEN7 - Non-critical Fault-State EOUT Signaling Enable n
 *  0b0..In Bi-Stable fault-output mode, both EOUT signaling and FIF assertion are disabled; in other fault-output
 *       modes, EOUT signaling is enabled and FIF assertion is disabled.
 *  0b1..Both EOUT signaling and FIF assertion are enabled in all fault-output modes.
 */
#define FCCU_EOUT_SIG_EN_EOUTEN7(x)              (((uint32_t)(((uint32_t)(x)) << FCCU_EOUT_SIG_EN_EOUTEN7_SHIFT)) & FCCU_EOUT_SIG_EN_EOUTEN7_MASK)
/*! @} */

/*! @name TMR_ALARM - Alarm-State Timer */
/*! @{ */

